# IMPORTING PANDAS

In [1]:
import pandas as pd

In [4]:
list = [1,2,3,4]

In [5]:
list

[1, 2, 3, 4]

In [6]:
print(type(list))

<class 'list'>

In [7]:
tuple = ("a","b","c","d")
tuple
print(type(tuple))

<class 'tuple'>

In [8]:
tuple

('a', 'b', 'c', 'd')

#CONVERTING TUPLE INTO SERIES USING PANDAS

In [9]:
tuples = pd.Series(tuple)

In [10]:
tuples

0    a
1    b
2    c
3    d
dtype: object

In [11]:
print(type(tuples))

<class 'pandas.core.series.Series'>

# CONVERTING DICTIONARY INTO DATAFRAME

In [12]:
dict = {"a":"Sinchu","b":"Rachu","c":"Sanju","d":"Luxu"}
dict

{'a': 'Sinchu', 'b': 'Rachu', 'c': 'Sanju', 'd': 'Luxu'}

In [13]:
cricket = {
'Name':['Virat Kohli','Rohit Sharma','MS Dhoni','Shikar Dhawan','Suresh Raina','KL Rahul','Hardhik Pandya','Rajat Patidhar','Mohammad Siraj','Shubhnam Gill'],
'Course':['BCom','MBA','PUC','BE','BA','BCom','BTech','BCA','MTech','BE'],
'Place':['Delhi','Mumbai','Ranchi','Bopal','Ahemadabad','Mangaluru','Baroda','Bhubaneshwar','Hyderabad','Chattisgarh'],
"Regno":['U01BE1','U01BE2','U01BE5','U01BE9','U01BE4','U01BE8','U01BE3','U01BE6','U01BE7','U01BE10'],
"Phno":[8951362940,8553748646,9902218516,8105088203,6156479003,8446095060,7010557849,9152388000,7865010167,6230230784],
"CGPA":[9.98,8.54,6.01,7.45,5.68,9.45,8.02,8.67,6.98,7.87]
}
cricket

{'Name': ['Virat Kohli',
  'Rohit Sharma',
  'MS Dhoni',
  'Shikar Dhawan',
  'Suresh Raina',
  'KL Rahul',
  'Hardhik Pandya',
  'Rajat Patidhar',
  'Mohammad Siraj',
  'Shubhnam Gill'],
 'Course': ['BCom',
  'MBA',
  'PUC',
  'BE',
  'BA',
  'BCom',
  'BTech',
  'BCA',
  'MTech',
  'BE'],
 'Place': ['Delhi',
  'Mumbai',
  'Ranchi',
  'Bopal',
  'Ahemadabad',
  'Mangaluru',
  'Baroda',
  'Bhubaneshwar',
  'Hyderabad',
  'Chattisgarh'],
 'Regno': ['U01BE1',
  'U01BE2',
  'U01BE5',
  'U01BE9',
  'U01BE4',
  'U01BE8',
  'U01BE3',
  'U01BE6',
  'U01BE7',
  'U01BE10'],
 'Phno': [8951362940,
  8553748646,
  9902218516,
  8105088203,
  6156479003,
  8446095060,
  7010557849,
  9152388000,
  7865010167,
  6230230784],
 'CGPA': [9.98, 8.54, 6.01, 7.45, 5.68, 9.45, 8.02, 8.67, 6.98, 7.87]}

In [14]:
crickets = pd.DataFrame(data = cricket , index = ['a','b','c','d','e','f','g','h','i','j'])
crickets

             Name Course         Place    Regno        Phno  CGPA
a     Virat Kohli   BCom         Delhi   U01BE1  8951362940  9.98
b    Rohit Sharma    MBA        Mumbai   U01BE2  8553748646  8.54
c        MS Dhoni    PUC        Ranchi   U01BE5  9902218516  6.01
d   Shikar Dhawan     BE         Bopal   U01BE9  8105088203  7.45
e    Suresh Raina     BA    Ahemadabad   U01BE4  6156479003  5.68
f        KL Rahul   BCom     Mangaluru   U01BE8  8446095060  9.45
g  Hardhik Pandya  BTech        Baroda   U01BE3  7010557849  8.02
h  Rajat Patidhar    BCA  Bhubaneshwar   U01BE6  9152388000  8.67
i  Mohammad Siraj  MTech     Hyderabad   U01BE7  7865010167  6.98
j   Shubhnam Gill     BE   Chattisgarh  U01BE10  6230230784  7.87

In [15]:
print(type(crickets))

<class 'pandas.core.frame.DataFrame'>

# DATA ACCESSABILITY USING
#  . DOT OPERATOR
#  [] OPERATOR
#  [[]] OPERATOR

In [16]:
crickets.Name

a       Virat Kohli
b      Rohit Sharma
c          MS Dhoni
d     Shikar Dhawan
e      Suresh Raina
f          KL Rahul
g    Hardhik Pandya
h    Rajat Patidhar
i    Mohammad Siraj
j     Shubhnam Gill
Name: Name, dtype: object

In [17]:
crickets["Course"]

a     BCom
b      MBA
c      PUC
d       BE
e       BA
f     BCom
g    BTech
h      BCA
i    MTech
j       BE
Name: Course, dtype: object

In [18]:
crickets.select_dtypes("number")

         Phno  CGPA
a  8951362940  9.98
b  8553748646  8.54
c  9902218516  6.01
d  8105088203  7.45
e  6156479003  5.68
f  8446095060  9.45
g  7010557849  8.02
h  9152388000  8.67
i  7865010167  6.98
j  6230230784  7.87

# ADDING EXTRA COLUMN TO EXISTING DATA

In [19]:
crickets["specialization"]=["a","b","c","d","e","f","g","h","i","j"]

In [20]:
crickets

,Name,Course,Place,Regno,Phno,CGPA,specialization
a,Virat Kohli,BCom,Delhi,U01BE1,8951362940,9.98,a
b,Rohit Sharma,MBA,Mumbai,U01BE2,8553748646,8.54,b
c,MS Dhoni,PUC,Ranchi,U01BE5,9902218516,6.01,c
d,Shikar Dhawan,BE,Bopal,U01BE9,8105088203,7.45,d
e,Suresh Raina,BA,Ahemadabad,U01BE4,6156479003,5.68,e
f,KL Rahul,BCom,Mangaluru,U01BE8,8446095060,9.45,f
g,Hardhik Pandya,BTech,Baroda,U01BE3,7010557849,8.02,g
h,Rajat Patidhar,BCA,Bhubaneshwar,U01BE6,9152388000,8.67,h
i,Mohammad Siraj,MTech,Hyderabad,U01BE7,7865010167,6.98,i
j,Shubhnam Gill,BE,Chattisgarh,U01BE10,6230230784,7.87,j

# DELETING A COLUMN
# AXIS REPRESENTS 0 AS ROWS AND 1 AS COLUMNS
# INPLACE REPRESENTS FALSE AS TEMPORARY CHANGE AND TRUE AS PERMANENT CHANGE

In [21]:
crickets.drop(labels="specialization", axis=1 ,inplace= False)

             Name Course         Place    Regno        Phno  CGPA
a     Virat Kohli   BCom         Delhi   U01BE1  8951362940  9.98
b    Rohit Sharma    MBA        Mumbai   U01BE2  8553748646  8.54
c        MS Dhoni    PUC        Ranchi   U01BE5  9902218516  6.01
d   Shikar Dhawan     BE         Bopal   U01BE9  8105088203  7.45
e    Suresh Raina     BA    Ahemadabad   U01BE4  6156479003  5.68
f        KL Rahul   BCom     Mangaluru   U01BE8  8446095060  9.45
g  Hardhik Pandya  BTech        Baroda   U01BE3  7010557849  8.02
h  Rajat Patidhar    BCA  Bhubaneshwar   U01BE6  9152388000  8.67
i  Mohammad Siraj  MTech     Hyderabad   U01BE7  7865010167  6.98
j   Shubhnam Gill     BE   Chattisgarh  U01BE10  6230230784  7.87

# RENAMING A COLUMNS NAME

In [22]:
crickets.rename({"Phno":"Mobno","Place":"BPlace"}, axis=1,inplace= True)

In [23]:
crickets

,Name,Course,BPlace,Regno,Mobno,CGPA,specialization
a,Virat Kohli,BCom,Delhi,U01BE1,8951362940,9.98,a
b,Rohit Sharma,MBA,Mumbai,U01BE2,8553748646,8.54,b
c,MS Dhoni,PUC,Ranchi,U01BE5,9902218516,6.01,c
d,Shikar Dhawan,BE,Bopal,U01BE9,8105088203,7.45,d
e,Suresh Raina,BA,Ahemadabad,U01BE4,6156479003,5.68,e
f,KL Rahul,BCom,Mangaluru,U01BE8,8446095060,9.45,f
g,Hardhik Pandya,BTech,Baroda,U01BE3,7010557849,8.02,g
h,Rajat Patidhar,BCA,Bhubaneshwar,U01BE6,9152388000,8.67,h
i,Mohammad Siraj,MTech,Hyderabad,U01BE7,7865010167,6.98,i
j,Shubhnam Gill,BE,Chattisgarh,U01BE10,6230230784,7.87,j

# ADDING MULTIPLE COLUMN AT USING SINGLE LINE CODE

In [24]:
crickets["profession"],crickets["age"]=["Cricketer","Cricketer","Cricketer","Cricketer","Cricketer","Cricketer","Cricketer","Cricketer","Cricketer","Cricketer"],[18,18,18,18,18,18,18,18,18,18]
crickets

,Name,Course,BPlace,Regno,Mobno,CGPA,specialization,profession,age
a,Virat Kohli,BCom,Delhi,U01BE1,8951362940,9.98,a,Cricketer,18
b,Rohit Sharma,MBA,Mumbai,U01BE2,8553748646,8.54,b,Cricketer,18
c,MS Dhoni,PUC,Ranchi,U01BE5,9902218516,6.01,c,Cricketer,18
d,Shikar Dhawan,BE,Bopal,U01BE9,8105088203,7.45,d,Cricketer,18
e,Suresh Raina,BA,Ahemadabad,U01BE4,6156479003,5.68,e,Cricketer,18
f,KL Rahul,BCom,Mangaluru,U01BE8,8446095060,9.45,f,Cricketer,18
g,Hardhik Pandya,BTech,Baroda,U01BE3,7010557849,8.02,g,Cricketer,18
h,Rajat Patidhar,BCA,Bhubaneshwar,U01BE6,9152388000,8.67,h,Cricketer,18
i,Mohammad Siraj,MTech,Hyderabad,U01BE7,7865010167,6.98,i,Cricketer,18
j,Shubhnam Gill,BE,Chattisgarh,U01BE10,6230230784,7.87,j,Cricketer,18

In [25]:
crickets.drop(labels = ['h'], axis = 0, inplace = True)

In [26]:
crickets

,Name,Course,BPlace,Regno,Mobno,CGPA,specialization,profession,age
a,Virat Kohli,BCom,Delhi,U01BE1,8951362940,9.98,a,Cricketer,18
b,Rohit Sharma,MBA,Mumbai,U01BE2,8553748646,8.54,b,Cricketer,18
c,MS Dhoni,PUC,Ranchi,U01BE5,9902218516,6.01,c,Cricketer,18
d,Shikar Dhawan,BE,Bopal,U01BE9,8105088203,7.45,d,Cricketer,18
e,Suresh Raina,BA,Ahemadabad,U01BE4,6156479003,5.68,e,Cricketer,18
f,KL Rahul,BCom,Mangaluru,U01BE8,8446095060,9.45,f,Cricketer,18
g,Hardhik Pandya,BTech,Baroda,U01BE3,7010557849,8.02,g,Cricketer,18
i,Mohammad Siraj,MTech,Hyderabad,U01BE7,7865010167,6.98,i,Cricketer,18
j,Shubhnam Gill,BE,Chattisgarh,U01BE10,6230230784,7.87,j,Cricketer,18

# ADDING SINGLE VALUE TO EVERY ROW

In [27]:
crickets["College"]="abc"
crickets

,Name,Course,BPlace,Regno,Mobno,CGPA,specialization,profession,age,College
a,Virat Kohli,BCom,Delhi,U01BE1,8951362940,9.98,a,Cricketer,18,abc
b,Rohit Sharma,MBA,Mumbai,U01BE2,8553748646,8.54,b,Cricketer,18,abc
c,MS Dhoni,PUC,Ranchi,U01BE5,9902218516,6.01,c,Cricketer,18,abc
d,Shikar Dhawan,BE,Bopal,U01BE9,8105088203,7.45,d,Cricketer,18,abc
e,Suresh Raina,BA,Ahemadabad,U01BE4,6156479003,5.68,e,Cricketer,18,abc
f,KL Rahul,BCom,Mangaluru,U01BE8,8446095060,9.45,f,Cricketer,18,abc
g,Hardhik Pandya,BTech,Baroda,U01BE3,7010557849,8.02,g,Cricketer,18,abc
i,Mohammad Siraj,MTech,Hyderabad,U01BE7,7865010167,6.98,i,Cricketer,18,abc
j,Shubhnam Gill,BE,Chattisgarh,U01BE10,6230230784,7.87,j,Cricketer,18,abc

In [28]:
crickets

,Name,Course,BPlace,Regno,Mobno,CGPA,specialization,profession,age,College
a,Virat Kohli,BCom,Delhi,U01BE1,8951362940,9.98,a,Cricketer,18,abc
b,Rohit Sharma,MBA,Mumbai,U01BE2,8553748646,8.54,b,Cricketer,18,abc
c,MS Dhoni,PUC,Ranchi,U01BE5,9902218516,6.01,c,Cricketer,18,abc
d,Shikar Dhawan,BE,Bopal,U01BE9,8105088203,7.45,d,Cricketer,18,abc
e,Suresh Raina,BA,Ahemadabad,U01BE4,6156479003,5.68,e,Cricketer,18,abc
f,KL Rahul,BCom,Mangaluru,U01BE8,8446095060,9.45,f,Cricketer,18,abc
g,Hardhik Pandya,BTech,Baroda,U01BE3,7010557849,8.02,g,Cricketer,18,abc
i,Mohammad Siraj,MTech,Hyderabad,U01BE7,7865010167,6.98,i,Cricketer,18,abc
j,Shubhnam Gill,BE,Chattisgarh,U01BE10,6230230784,7.87,j,Cricketer,18,abc

In [29]:
crickets.drop( labels = ["d"], axis = 0 , inplace = True)

In [30]:
crickets

,Name,Course,BPlace,Regno,Mobno,CGPA,specialization,profession,age,College
a,Virat Kohli,BCom,Delhi,U01BE1,8951362940,9.98,a,Cricketer,18,abc
b,Rohit Sharma,MBA,Mumbai,U01BE2,8553748646,8.54,b,Cricketer,18,abc
c,MS Dhoni,PUC,Ranchi,U01BE5,9902218516,6.01,c,Cricketer,18,abc
e,Suresh Raina,BA,Ahemadabad,U01BE4,6156479003,5.68,e,Cricketer,18,abc
f,KL Rahul,BCom,Mangaluru,U01BE8,8446095060,9.45,f,Cricketer,18,abc
g,Hardhik Pandya,BTech,Baroda,U01BE3,7010557849,8.02,g,Cricketer,18,abc
i,Mohammad Siraj,MTech,Hyderabad,U01BE7,7865010167,6.98,i,Cricketer,18,abc
j,Shubhnam Gill,BE,Chattisgarh,U01BE10,6230230784,7.87,j,Cricketer,18,abc

# IMPORTING NUMPY

In [31]:
import pandas as pd
import numpy as np

In [32]:
students = {
    "Name":["Rahul","Divya","Sneha","Virat","Pawan","Kruthi"],
    "Roll No":["U01BES0101","U01BES0102","U01BES0103","U01BES0104","U01BES0105","U01BES0106"],
    "Course":["Biotech","Microbiology","Zoology","Physics","Mathematics","Computer"],
    "CGPA":[9.7,8.5,5.7,6.8,8.7,7.9]
}
students

{'Name': ['Rahul', 'Divya', 'Sneha', 'Virat', 'Pawan', 'Kruthi'],
 'Roll No': ['U01BES0101',
  'U01BES0102',
  'U01BES0103',
  'U01BES0104',
  'U01BES0105',
  'U01BES0106'],
 'Course': ['Biotech',
  'Microbiology',
  'Zoology',
  'Physics',
  'Mathematics',
  'Computer'],
 'CGPA': [9.7, 8.5, 5.7, 6.8, 8.7, 7.9]}

In [34]:
crickets["internals_marks"] = [93,np.nan,67,np.nan,76,89,54,67]
crickets

,Name,Course,BPlace,Regno,Mobno,CGPA,specialization,profession,age,College,internals_marks
a,Virat Kohli,BCom,Delhi,U01BE1,8951362940,9.98,a,Cricketer,18,abc,93.0
b,Rohit Sharma,MBA,Mumbai,U01BE2,8553748646,8.54,b,Cricketer,18,abc,NaN
c,MS Dhoni,PUC,Ranchi,U01BE5,9902218516,6.01,c,Cricketer,18,abc,67.0
e,Suresh Raina,BA,Ahemadabad,U01BE4,6156479003,5.68,e,Cricketer,18,abc,NaN
f,KL Rahul,BCom,Mangaluru,U01BE8,8446095060,9.45,f,Cricketer,18,abc,76.0
g,Hardhik Pandya,BTech,Baroda,U01BE3,7010557849,8.02,g,Cricketer,18,abc,89.0
i,Mohammad Siraj,MTech,Hyderabad,U01BE7,7865010167,6.98,i,Cricketer,18,abc,54.0
j,Shubhnam Gill,BE,Chattisgarh,U01BE10,6230230784,7.87,j,Cricketer,18,abc,67.0

In [35]:
student = pd.DataFrame(students)
student

     Name     Roll No        Course  CGPA
0   Rahul  U01BES0101       Biotech   9.7
1   Divya  U01BES0102  Microbiology   8.5
2   Sneha  U01BES0103       Zoology   5.7
3   Virat  U01BES0104       Physics   6.8
4   Pawan  U01BES0105   Mathematics   8.7
5  Kruthi  U01BES0106      Computer   7.9

In [36]:
student["College"]="Newton's school of technology"
student

     Name     Roll No        Course  CGPA                        College
0   Rahul  U01BES0101       Biotech   9.7  Newton's school of technology
1   Divya  U01BES0102  Microbiology   8.5  Newton's school of technology
2   Sneha  U01BES0103       Zoology   5.7  Newton's school of technology
3   Virat  U01BES0104       Physics   6.8  Newton's school of technology
4   Pawan  U01BES0105   Mathematics   8.7  Newton's school of technology
5  Kruthi  U01BES0106      Computer   7.9  Newton's school of technology

# IMPUTING NAN VALUES

In [37]:
student["Internal_marks"]=[98,83,70,np.nan,90,82]

In [38]:
student

,Name,Roll No,Course,CGPA,College,Internal_marks
0,Rahul,U01BES0101,Biotech,9.7,Newton's school of technology,98.0
1,Divya,U01BES0102,Microbiology,8.5,Newton's school of technology,83.0
2,Sneha,U01BES0103,Zoology,5.7,Newton's school of technology,70.0
3,Virat,U01BES0104,Physics,6.8,Newton's school of technology,NaN
4,Pawan,U01BES0105,Mathematics,8.7,Newton's school of technology,90.0
5,Kruthi,U01BES0106,Computer,7.9,Newton's school of technology,82.0

# IMPUTING MISSING VALUES USING MEAN, MODE AND MEDIAN

In [39]:
student["Internal_marks"].fillna(student.Internal_marks.mean())

0    98.0
1    83.0
2    70.0
3    84.6
4    90.0
5    82.0
Name: Internal_marks, dtype: float64

In [40]:
student["Internal_marks"].fillna(student.Internal_marks.mode())

0    98.0
1    83.0
2    70.0
3    90.0
4    90.0
5    82.0
Name: Internal_marks, dtype: float64

In [41]:
student["Internal_marks"].fillna(student.Internal_marks.median())

0    98.0
1    83.0
2    70.0
3    83.0
4    90.0
5    82.0
Name: Internal_marks, dtype: float64

# FFILL AND BFILL
# FFILL IMPUTE FORWARD FILLING
# BFILL IMPUTE BACKWARD FILLING

In [42]:
student.Internal_marks.ffill()

0    98.0
1    83.0
2    70.0
3    70.0
4    90.0
5    82.0
Name: Internal_marks, dtype: float64

In [43]:
student.Internal_marks.bfill()

0    98.0
1    83.0
2    70.0
3    90.0
4    90.0
5    82.0
Name: Internal_marks, dtype: float64

In [44]:
d2 = {'Name': 'Sohan', 'Course' :'BE', 'Roll No' :'U01BES0107', 'CGPA': 80 , 'Internal_marks' : 20}

# info() in Pandas
# Purpose: Gives a concise summary of the dataset (structure + data types).
# What it shows:
# Number of rows & columns
# Column names
# Data types of each column (int, float, object, etc.)
# Count of non-null (not missing) values
# Memory usage

In [47]:
student.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            6 non-null      object
 1   Roll No         6 non-null      object
 2   Course          6 non-null      object
 3   CGPA            6 non-null      float64
 4   College         6 non-null      object
 5   Internal_marks  5 non-null      float64
dtypes: float64(2), object(4)
memory usage: 420.0+ bytes

# DESCRIBE IN PANDAS
# GIVES NUMERICAL SUMMARY LIKE MEAN, MODE , MEDIAN ,VARIANCE AND STANDARD DEVIATION

In [49]:
student.describe()

           CGPA  Internal_marks
count  6.000000        5.000000
mean   7.883333       84.600000
std    1.434457       10.382678
min    5.700000       70.000000
25%    7.075000       82.000000
50%    8.200000       83.000000
75%    8.650000       90.000000
max    9.700000       98.000000

In [52]:
student.describe( include="O")

         Name     Roll No   Course                        College
count       6           6        6                              6
unique      6           6        6                              1
top     Rahul  U01BES0101  Biotech  Newton's school of technology
freq        1           1        1                              6

In [60]:
student.dtypes

Name               object
Roll No            object
Course             object
CGPA              float64
College            object
Internal_marks    float64
dtype: object

In [61]:
student.index

RangeIndex(start=0, stop=6, step=1)

In [62]:
student.columns

Index(['Name', 'Roll No', 'Course', 'CGPA', 'College', 'Internal_marks'], dtype='object')

In [63]:
student.select_dtypes("object")

     Name     Roll No        Course                        College
0   Rahul  U01BES0101       Biotech  Newton's school of technology
1   Divya  U01BES0102  Microbiology  Newton's school of technology
2   Sneha  U01BES0103       Zoology  Newton's school of technology
3   Virat  U01BES0104       Physics  Newton's school of technology
4   Pawan  U01BES0105   Mathematics  Newton's school of technology
5  Kruthi  U01BES0106      Computer  Newton's school of technology

In [66]:
student.select_dtypes("number")

   CGPA  Internal_marks
0   9.7            98.0
1   8.5            83.0
2   5.7            70.0
3   6.8             NaN
4   8.7            90.0
5   7.9            82.0

In [67]:
student

,Name,Roll No,Course,CGPA,College,Internal_marks
0,Rahul,U01BES0101,Biotech,9.7,Newton's school of technology,98.0
1,Divya,U01BES0102,Microbiology,8.5,Newton's school of technology,83.0
2,Sneha,U01BES0103,Zoology,5.7,Newton's school of technology,70.0
3,Virat,U01BES0104,Physics,6.8,Newton's school of technology,NaN
4,Pawan,U01BES0105,Mathematics,8.7,Newton's school of technology,90.0
5,Kruthi,U01BES0106,Computer,7.9,Newton's school of technology,82.0

In [68]:
student["Internal_marks"].fillna(student.Internal_marks.mean())

0    98.0
1    83.0
2    70.0
3    84.6
4    90.0
5    82.0
Name: Internal_marks, dtype: float64

In [78]:
student.Internal_marks.bfill()

0    98.0
1    83.0
2    70.0
3    90.0
4    90.0
5    82.0
Name: Internal_marks, dtype: float64

In [79]:
student.Internal_marks.ffill()

0    98.0
1    83.0
2    70.0
3    70.0
4    90.0
5    82.0
Name: Internal_marks, dtype: float64

# CONCATINATE
# Append the datasets

In [80]:
df7 = pd.DataFrame({"customer":['101','102','103','104'], 
                    'category': ['cat2','cat2','cat1','cat3'],
                    'important': ['yes','no','yes','yes'],
                    'sales': [123,52,214,663]},index=[0,1,2,3])

df8 = pd.DataFrame({"customer":['101','103','104','105'], 
                    'color': ['yellow','green','green','blue'],
                    'distance': [12,9,44,21],
                    'sales': [123,214,663,331]},index=[4,5,6,7])

In [82]:
print(df7)
print(df8)

  customer category important  sales
0      101     cat2       yes    123
1      102     cat2        no     52
2      103     cat1       yes    214
3      104     cat3       yes    663
  customer   color  distance  sales
4      101  yellow        12    123
5      103   green         9    214
6      104   green        44    663
7      105    blue        21    331

In [85]:
pd.concat([df7,df8],axis = 1, sort = True)

  customer category important  sales customer   color  distance  sales
0      101     cat2       yes  123.0      NaN     NaN       NaN    NaN
1      102     cat2        no   52.0      NaN     NaN       NaN    NaN
2      103     cat1       yes  214.0      NaN     NaN       NaN    NaN
3      104     cat3       yes  663.0      NaN     NaN       NaN    NaN
4      NaN      NaN       NaN    NaN      101  yellow      12.0  123.0
5      NaN      NaN       NaN    NaN      103   green       9.0  214.0
6      NaN      NaN       NaN    NaN      104   green      44.0  663.0
7      NaN      NaN       NaN    NaN      105    blue      21.0  331.0

In [86]:
pd.concat([df7,df8], axis = 0, sort= False)

  customer category important  sales   color  distance
0      101     cat2       yes    123     NaN       NaN
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214     NaN       NaN
3      104     cat3       yes    663     NaN       NaN
4      101      NaN       NaN    123  yellow      12.0
5      103      NaN       NaN    214   green       9.0
6      104      NaN       NaN    663   green      44.0
7      105      NaN       NaN    331    blue      21.0

# MERGE
# COMBINE TWO DATASETS

In [ ]:
pd.merge(df7,df8, how = "inner")

In [95]:
pd.merge(df7,df8, how="outer")

  customer category important  sales   color  distance
0      101     cat2       yes    123  yellow      12.0
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214   green       9.0
3      104     cat3       yes    663   green      44.0
4      105      NaN       NaN    331    blue      21.0

In [96]:
pd.merge(df7,df8, how ="left")

  customer category important  sales   color  distance
0      101     cat2       yes    123  yellow      12.0
1      102     cat2        no     52     NaN       NaN
2      103     cat1       yes    214   green       9.0
3      104     cat3       yes    663   green      44.0

In [97]:
pd.merge(df7,df8, how="right")

  customer category important  sales   color  distance
0      101     cat2       yes    123  yellow        12
1      103     cat1       yes    214   green         9
2      104     cat3       yes    663   green        44
3      105      NaN       NaN    331    blue        21

# JOIN 
# COMBINE TWO OR MORE DATASETS BASED ON INDEX

In [108]:
df9 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I6','I4','I5'])

df10 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

print(df9)
print()
print(df10)

     Q1   Q2
I6  101  201
I4  102  202
I5  103  203

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [109]:
df9.join(df10 , how="inner")

Empty DataFrame
Columns: [Q1, Q2, Q3, Q4]
Index: []

In [110]:
df9.join(df10, how="outer")

       Q1     Q2     Q3     Q4
I0    NaN    NaN  301.0  401.0
I2    NaN    NaN  302.0  402.0
I3    NaN    NaN  303.0  403.0
I4  102.0  202.0    NaN    NaN
I5  103.0  203.0    NaN    NaN
I6  101.0  201.0    NaN    NaN

In [111]:
df9.join(df10, how="left")

     Q1   Q2  Q3  Q4
I6  101  201 NaN NaN
I4  102  202 NaN NaN
I5  103  203 NaN NaN

In [112]:
df10.join(df9, how="left")

     Q3   Q4  Q1  Q2
I0  301  401 NaN NaN
I2  302  402 NaN NaN
I3  303  403 NaN NaN

In [115]:
df1 = pd.DataFrame({'Q1': [101,102,103],
                    'Q2': [201,202,203]},
                   index=['I0','I1','I2'])

df2 = pd.DataFrame({'Q3': [301,302,303],
                    'Q4': [401,402,403]},
                   index=['I0','I2','I3'])

print(df1)
print()
print(df2)

     Q1   Q2
I0  101  201
I1  102  202
I2  103  203

     Q3   Q4
I0  301  401
I2  302  402
I3  303  403

In [116]:
df1.join(df2, how="inner")

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  203  302  402

In [117]:
df1.join(df2, how="left")

     Q1   Q2     Q3     Q4
I0  101  201  301.0  401.0
I1  102  202    NaN    NaN
I2  103  203  302.0  402.0

In [118]:
df2.join(df1, how="left")

     Q3   Q4     Q1     Q2
I0  301  401  101.0  201.0
I2  302  402  103.0  203.0
I3  303  403    NaN    NaN

In [119]:
df1.join(df2, how="outer")

       Q1     Q2     Q3     Q4
I0  101.0  201.0  301.0  401.0
I1  102.0  202.0    NaN    NaN
I2  103.0  203.0  302.0  402.0
I3    NaN    NaN  303.0  403.0

# CONDITIONAL STATEMENT

In [121]:
con = [
    {"Name": "Amit",  "RollNo": 101, "Percentage": 85.5, "City": "Delhi",     "Age": 20, "Extra_Activity": "Cricket"},
    {"Name": "Priya", "RollNo": 102, "Percentage": 92.0, "City": "Mumbai",    "Age": 19, "Extra_Activity": "Dance"},
    {"Name": "Rahul", "RollNo": 103, "Percentage": 76.5, "City": "Bangalore", "Age": 21, "Extra_Activity": "Music"},
    {"Name": "Sneha", "RollNo": 104, "Percentage": 88.0, "City": "Chennai",   "Age": 20, "Extra_Activity": "Drama"},
    {"Name": "Kiran", "RollNo": 105, "Percentage": 69.5, "City": "Kolkata",   "Age": 22, "Extra_Activity": "Painting"},
    {"Name": "Anita", "RollNo": 106, "Percentage": 95.2, "City": "Pune",      "Age": 19, "Extra_Activity": "Debate"}
]
con

[{'Name': 'Amit',
  'RollNo': 101,
  'Percentage': 85.5,
  'City': 'Delhi',
  'Age': 20,
  'Extra_Activity': 'Cricket'},
 {'Name': 'Priya',
  'RollNo': 102,
  'Percentage': 92.0,
  'City': 'Mumbai',
  'Age': 19,
  'Extra_Activity': 'Dance'},
 {'Name': 'Rahul',
  'RollNo': 103,
  'Percentage': 76.5,
  'City': 'Bangalore',
  'Age': 21,
  'Extra_Activity': 'Music'},
 {'Name': 'Sneha',
  'RollNo': 104,
  'Percentage': 88.0,
  'City': 'Chennai',
  'Age': 20,
  'Extra_Activity': 'Drama'},
 {'Name': 'Kiran',
  'RollNo': 105,
  'Percentage': 69.5,
  'City': 'Kolkata',
  'Age': 22,
  'Extra_Activity': 'Painting'},
 {'Name': 'Anita',
  'RollNo': 106,
  'Percentage': 95.2,
  'City': 'Pune',
  'Age': 19,
  'Extra_Activity': 'Debate'}]

In [123]:
cond=pd.DataFrame(con)
cond

    Name  RollNo  Percentage       City  Age Extra_Activity
0   Amit     101        85.5      Delhi   20        Cricket
1  Priya     102        92.0     Mumbai   19          Dance
2  Rahul     103        76.5  Bangalore   21          Music
3  Sneha     104        88.0    Chennai   20          Drama
4  Kiran     105        69.5    Kolkata   22       Painting
5  Anita     106        95.2       Pune   19         Debate

In [129]:
cond[(cond.Percentage>70) & (cond.City=="Bangalore")]

    Name  RollNo  Percentage       City  Age Extra_Activity
2  Rahul     103        76.5  Bangalore   21          Music

In [130]:
cond[(cond.RollNo>102) & (cond.Percentage>87)]

    Name  RollNo  Percentage     City  Age Extra_Activity
3  Sneha     104        88.0  Chennai   20          Drama
5  Anita     106        95.2     Pune   19         Debate

In [3]:
import pandas as pd

# GROUPBY

In [8]:
da  =  {'items' : ['veg_burger', 'veg_burger', 'chicken_burger','chicken_burger', 'softy_icecream', 'softy_icecream'], 
       
       'sale' : [100, 200, 100, 250, 150, 50] , 'cities' : ['c1', 'c2', 'c1', 'c2', 'c1', 'c2']}

sales  =  pd.DataFrame(da)
sales

            items  sale cities
0      veg_burger   100     c1
1      veg_burger   200     c2
2  chicken_burger   100     c1
3  chicken_burger   250     c2
4  softy_icecream   150     c1
5  softy_icecream    50     c2

In [9]:
sales.groupby(by = "items").max()

                sale cities
items
chicken_burger   250     c2
softy_icecream   150     c2
veg_burger       200     c2

In [10]:
sales.groupby(by = "sale").max()

               items cities
sale
50    softy_icecream     c2
100       veg_burger     c1
150   softy_icecream     c1
200       veg_burger     c2
250   chicken_burger     c2

In [11]:
sales.groupby(by = "sale").min()

               items cities
sale
50    softy_icecream     c2
100   chicken_burger     c1
150   softy_icecream     c1
200       veg_burger     c2
250   chicken_burger     c2

In [12]:
sales.groupby(by = "sale").count()

      items  cities
sale
50        1       1
100       2       2
150       1       1
200       1       1
250       1       1

# pandas is mainly used to read the data and also access data from multiple or different sources

# CONVERT INTO CSV

In [21]:
sales.to_csv("sales.csv")

In [23]:
sales_csv =pd.read_csv("sales.csv")
sales_csv

   Unnamed: 0           items  sale cities
0           0      veg_burger   100     c1
1           1      veg_burger   200     c2
2           2  chicken_burger   100     c1
3           3  chicken_burger   250     c2
4           4  softy_icecream   150     c1
5           5  softy_icecream    50     c2

In [25]:
sales_csv.head()

   Unnamed: 0           items  sale cities
0           0      veg_burger   100     c1
1           1      veg_burger   200     c2
2           2  chicken_burger   100     c1
3           3  chicken_burger   250     c2
4           4  softy_icecream   150     c1

In [26]:
sales_csv.tail()

   Unnamed: 0           items  sale cities
1           1      veg_burger   200     c2
2           2  chicken_burger   100     c1
3           3  chicken_burger   250     c2
4           4  softy_icecream   150     c1
5           5  softy_icecream    50     c2

In [27]:
sales_csv.describe()

       Unnamed: 0        sale
count    6.000000    6.000000
mean     2.500000  141.666667
std      1.870829   73.598007
min      0.000000   50.000000
25%      1.250000  100.000000
50%      2.500000  125.000000
75%      3.750000  187.500000
max      5.000000  250.000000

In [28]:
sales_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  6 non-null      int64
 1   items       6 non-null      object
 2   sale        6 non-null      int64
 3   cities      6 non-null      object
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [32]:
sales_csv["items"].unique()

array(['veg_burger', 'chicken_burger', 'softy_icecream'], dtype=object)

In [33]:
sales_csv["cities"].unique()

array(['c1', 'c2'], dtype=object)

In [38]:
sales_csv["sale"].value_counts()

sale
100    2
200    1
250    1
150    1
50     1
Name: count, dtype: int64

In [42]:
sales_csv.sort_values("items")

   Unnamed: 0           items  sale cities
2           2  chicken_burger   100     c1
3           3  chicken_burger   250     c2
4           4  softy_icecream   150     c1
5           5  softy_icecream    50     c2
0           0      veg_burger   100     c1
1           1      veg_burger   200     c2

In [43]:
sales_csv.sort_values("sale")

   Unnamed: 0           items  sale cities
5           5  softy_icecream    50     c2
0           0      veg_burger   100     c1
2           2  chicken_burger   100     c1
4           4  softy_icecream   150     c1
1           1      veg_burger   200     c2
3           3  chicken_burger   250     c2

In [45]:
#NULL VALUES

In [48]:
#student.isnull()   student.isnull().sum()     student.isnull().sum() / len(student}*100